CF/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦенаПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CF/CommonModules/СлужебныеФункции/Ext/Module.bsl
&НаСервере
Функция ПолучитьЦену(КонтрагентСсылка, НоменклатураСсылка, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	1 КАК Приоритет,
	               |	ЦеныНоменклатурыСрезПоследних.ЦенаПродажи КАК ЦенаПродажи
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			&Период,
	               |			Контрагент = &Контрагент
	               |				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	2,
	               |	ЦеныНоменклатурыСрезПоследних.ЦенаПродажи
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			&Период,
	               |			Контрагент = &ПустойКонтрагент
	               |				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Приоритет";
	Запрос.Параметры.Вставить("Период",Дата);
	Запрос.Параметры.Вставить("Контрагент",КонтрагентСсылка);
	Запрос.Параметры.Вставить("Номенклатура",НоменклатураСсылка);
	Запрос.Параметры.Вставить("ПустойКонтрагент",Справочники.Контрагенты.ПустаяСсылка());
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ЦенаПродажи;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции
